{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "arguments": {}, "dtype": "float32", "batch_input_shape": [null, 32, 64, 1], "name": "lambda_4", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-f13467d2528d>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 8, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_10", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 8, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_11", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 8, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_12", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 100, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 50, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 1, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}}], "backend": "tensorflow"}